const content_num = function(){
    return this.contents;
};

const $hs_subjects_data = [
    {
        id:"hs-Eng",
        units:[
            {
                unit_name:"英文法",
                unit_id:"grammer",
                textbooks:[
                    {   
                        id:"leadA",
                        title:"リードA　英文法",
                        level:"基礎",
                        contents:["文型","文の種類","基本時制","完了時制","助動詞","受動態","不定詞","動名詞","分詞",],
                    },
                    {
                        id:"lead1",
                        title:"リードⅠ　英文法",
                        level:"標準",
                        contents:["文型","文の種類","基本時制","完了形","助動詞","受動態","不定詞","動名詞","分詞",],
                    },
                    {
                        id:"g-lv-3",
                        title:"英文法　レベル別問題集3",
                        level:"基礎",
                        contents:["動詞・時制","受動態","不定詞","動名詞","分詞","分詞構文","関係詞","比較","仮定法","その他"]
                    },
                ]
            },
            {
                unit_name:"長文読解",
                unit_id:"reading",
                textbooks:[
                    {   
                        id:"yatteokitai300",
                        title:"やっておきたい英語長文300",
                        level:"基礎",
                        content_num: 30,
                        contents:["第1,2章","第3,4章","第5,6章","第7,8章","第9,10章","第11,12章","第13,14章","第15,16章","第17,18章","第19,20章","第21,22章","第23,24章","第25,26章","第27,28章","第29,30章",],
                    },
                ]}
        ]
    },
    {
        id:"hs-Japanese",
        units:[
            {
                unit_name:"現代文",
                unit_id:"modern-japanese"
            },
            {
                unit_name:"古文",
                unit_id:"classical-japanese",
                textbooks:[
                    {   
                        id:"bunpo-training",
                        title:"河合塾　古典文法基礎ドリル",
                        level:"基礎",
                        content_num: 30,
                        contents:["動詞(1)","動詞(2)","形容詞","形容動詞","助動詞入門","助動詞(1)「き」「けり」","助動詞(2)「つ」「ぬ」","助動詞(3)「ず」","助動詞(4)「たり」「り」","助動詞(5)「る」「らる」","助動詞(6)「す」「さす」「しむ」","第23,24章","第25,26章","第27,28章","第29,30章",],
                    },
                ],
            },
            {
                unit_name:"漢文",
                unit_id:"classical-chinese",
            },
        ]
    },
    {
        id:"hs-Math",
        units:[
            {
                unit_name:"数ⅠA",
                unit_id:"1a"
            },
            {
                unit_name:"数ⅡB",
                unit_id:"2b"
            },
            {
                unit_name:"数Ⅲ",
                unit_id:"3c",
            },
        ]
    },
    {
        id:"hs-Sci",
        units:[
            {
                unit_name:"化学<br>化学基礎",
                unit_id:"chemistry"
            },
            {
                unit_name:"物理<br>物理基礎",
                unit_id:"physics"
            },
            {
                unit_name:"生物<br>生物基礎",
                unit_id:"biology",
            },
            {
                unit_name:"地学<br>地学基礎",
                unit_id:"earth-science",
            },
        ]
    },
    {
        id:"hs-Soc",
        units:[
            {
                unit_name:"日本史",
                unit_id:"japanese-history"
            },
            {
                unit_name:"世界史",
                unit_id:"world-history"
            },
            {
                unit_name:"地理",
                unit_id:"geography",
            },
            {
                unit_name:"政治経済",
                unit_id:"political economy",
            },
            {
                unit_name:"現代社会",
                unit_id:"modern society",
            },
        ]
    },

];

const $ms_subjects_data = [
    {
        id:"ms-Eng",
        textbooks:[
            {   
                id:"mc-e-1",
                title:"マイクリア　中1",
                level:"基礎",
                content_num: 18,
                contents:["I am ~. You are ~ の文","This is ~. What is ~?の文","He is ~. Who is ~の文","一般動詞(1・2人称)","名詞の複数形","代名詞の複数形","形容詞、副詞","命令文","会話表現","canの文","一般動詞(3人称・単数）","目的格、所有代名詞","時刻、曜日","疑問文で始まる疑問文","現在進行形","規則動詞の過去形","不規則動詞の過去形","be動詞の過去形"],
            },
            {   
                id:"mc-e-2",
                title:"マイクリア　中2",
                level:"基礎",
                content_num: 18,
                contents:["一般動詞の過去形","be動詞の過去形","過去進行形","未来の文","助動詞","命令文","There is ~.の文","名詞、冠詞","代名詞","いろいろな疑問文","不定詞","動名詞","接続詞","文型","形容詞、副詞","比較(1)","比較(2)","前置詞"],
            },
            {   
                id:"mc-e-3",
                title:"マイクリア　中3",
                level:"基礎",
                content_num: 22,
                contents:["動詞","未来の文","助動詞","名詞、冠詞","形容詞、副詞","比較","基本文型","受動態","現在完了(1)","現在完了(2)","不定詞(1)","不定詞(2)","動名詞","分詞","関係代名詞(1)","関係代名詞(2)","疑問詞で始まる疑問文","間接疑問文、付加疑問文","仮定法","接続詞","前置詞","会話表現"],
            },
            {   
                id:"new-e-basic-1",
                title:"新中学問題集　標準編　1年",
                level:"基礎",
                content_num: 18,
                contents:["I am ~. You are ~ の文","This is ~. What is ~?の文","He is ~. Who is ~の文","一般動詞(1・2人称)","名詞・代名詞の複数形","形容詞、副詞","命令文","会話表現","canの文","一般動詞(3人称・単数）","目的格、所有代名詞","時刻、曜日","疑問文で始まる疑問文","現在進行形","規則動詞の過去形","不規則動詞の過去形","be動詞の過去形"],
            },
            {   
                id:"mc-e-basic-2",
                title:"新中学問題集　標準編　2年",
                level:"基礎",
                content_num: 18,
                contents:["一般動詞の過去形","be動詞の過去形","過去進行形","未来の文","助動詞","命令文","There is ~.の文","名詞、冠詞","代名詞","いろいろな疑問文","不定詞","動名詞","接続詞","文型","形容詞、副詞","比較(1)","比較(2)","前置詞","発音・アクセント・文の読み方"],
            },
            {   
                id:"mc-e-basic-3",
                title:"新中学問題集　標準編　3年",
                level:"基礎",
                content_num: 22,
                contents:["動詞","未来の文、助動詞","名詞、冠詞","代名詞","形容詞、副詞","比較","基本文型","受動態","現在完了(1)","現在完了(2)","不定詞(1)","不定詞(2)","動名詞","分詞","関係代名詞(1)","関係代名詞(2)","いろいろな疑問文","仮定法","接続詞","前置詞","会話表現","発音・アクセント・文の読み方"],
            },
        ],
    },
    {
        id:"ms-Japanese",
        textbooks:[
            {   
                id:"mc-j-1",
                title:"マイクリア　中1",
                level:"基礎",
                contents:["指示語","接続語","段落","キーワード・文脈","要旨","場面","会話・行動","心情","表現","主題","説明的文章の読み方・解き方","文学的文章の読み方・解き方","詩の鑑賞","短歌・俳句の鑑賞","作文(1)","説明的文章(1)","説明的文章(2)","文学的文章(1)","文学的文章(2)","詩歌","古文(1)","古文(2)","説明的文章(3)","説明的文章(4)","文学的文章(3)","文学的文章(4)","作文(2)","文法のまとめ(1)","文法のまとめ(2)","総合テスト(1)","総合テスト(2)","総合テスト(3)",],
            },
            {   
                id:"mc-j-2",
                title:"マイクリア　中2",
                level:"基礎",
                contents:["指示語","接続語","段落","キーワード・文脈","要旨","場面・行動","心情","表現","主題","説明的文章の読み方・解き方","文学的文章の読み方・解き方","詩の鑑賞","短歌・俳句の鑑賞","古文の読み方・解き方","作文(1)","説明的文章(1)","説明的文章(2)","文学的文章(1)","文学的文章(2)","詩歌","古文(1)","古文(2)","説明的文章(3)","説明的文章(4)","文学的文章(3)","文学的文章(4)","作文(2)","文法のまとめ(1)","文法のまとめ(2)","総合テスト(1)","総合テスト(2)","総合テスト(3)"],
            },
            {   
                id:"mc-j-3",
                title:"マイクリア　中3",
                level:"基礎",
                contents:["指示語・接続語","段落","キーワード・文脈","要旨","場面・行動","心情","表現","主題","説明的文章の読み方・解き方","文学的文章の読み方・解き方","詩の鑑賞","短歌・俳句の鑑賞","古文の読み方・解き方","作文(1)","説明的文章(1)","説明的文章(2)","文学的文章(1)","文学的文章(2)","詩歌","古典(1)<古文>","古典(2)<漢文>","説明的文章(3)","説明的文章(4)","文学的文章(3)","文学的文章(4)","古典(3)<古文・漢文>","古典(4)<古文>","作文(2)","文法のまとめ(1)","文法のまとめ(2)","入試対策テスト(1)","入試対策テスト(2)","入試対策テスト(3)"],
            },
            {   
                id:"new-j-basic-1",
                title:"新中学問題集　標準編　1年",
                level:"基礎",
                contents:["文学的文章(1) 場面","文学的文章(2) 人物","文学的文章(3) 心情","説明的文章(1) 指示語・接続語","説明的文章(2) 段落構成","説明的文章(3) 要旨","小説文(1)","随筆文(1)","説明文(1)","論説文(1)","詩","短歌・俳句","文法(1) 言葉の単位・品詞","文法(2) 文の成分・文節と文節の関係","小説文(2)","随筆文(2)","説明文(2)","論説文(2)","詩・短歌・俳句(1)","古文(1)","古文(2)","小説文(3)","随筆文(3)","説明文(3)","論説文(3)","詩・短歌・俳句(2)","古文(3)","総合問題(1)","総合問題(2)"],
            },
            {   
                id:"new-j-basic-2",
                title:"新中学問題集　標準編　2年",
                level:"基礎",
                contents:["文学的文章(1) 場面","文学的文章(2) 人物","文学的文章(3) 表現","説明的文章(1) 事実と意見","説明的文章(2) 段落構成","説明的文章(3) 要旨・要約","文法(1) 体言・用言","小説文(1)","随筆文(1)","説明文(1)","論説文(1)","詩(1)","短歌・俳句(1)","古文(1)","古文(2)","文法(2) 付属語","小説文(2)","随筆文(2)","説明文(2)","論説文(2)","詩(2)","短歌・俳句(2)","古文(3)","古文(4)","文法(3) 敬語・語の識別","小説文(3)","随筆文(3)","説明文(3)","論説文(3)","総合問題(1)","総合問題(2)"],
            },
        ],
    },
    {
        id:"ms-Math",
        textbooks:[
            {   
                id:"mc-m-1",
                title:"マイクリア　中1",
                level:"基礎",
                contents:["小学校の復習","素数、素因数分解","正負の数","加法","減法・加減混合","乗法","除法・乗除混合","四則の計算と利用","文字式の表し方(1)","文字式の表し方(2)","数量の表し方","文字式の計算","文字式の利用","方程式の解き方(1)","方程式の解き方(2)","方程式の利用(1)","方程式の利用(2)","比例と反比例","比例と反比例の式","座標","比例と反比例のグラフ","平面図形の基礎と移動","作図","おうぎ形","直線や平面の位置関係","柱体と錐体","体積と表面積","度数の分布","代表値"],
            },
            {   
                id:"mc-m-2",
                title:"マイクリア　中2",
                level:"基礎",
                contents:["1年の復習","式の加法と減法","式の乗法と除法","式の利用","連立方程式の解き方","いろいろな連立方程式","連立方程式の利用(1)","連立方程式の利用(2)","1次関数","1次関数のグラフ","1次関数の求め方","1次関数と方程式","1次関数の利用","平行線と角","三角形の角","多角形の角","合同な図形","三角形の合同の証明","二等辺三角形","直角三角形","平行四辺形の性質","平行四辺形になるための条件","特別な平行四辺形、平行線と面積","場合の数","確率","四分位範囲、箱ひげ図"],
            },
            {   
                id:"mc-m-3",
                title:"マイクリア　中3",
                level:"基礎",
                contents:["1・2年の復習","多項式の計算","乗法公式","素因数分解","因数分解","展開や因数分解の利用","平方根","平方根の計算","平方根の利用","2次方程式の解き方","2次方程式の利用","2乗に比例する関数","変域・変化の割合","放物線と直線","相似な図形","平行線と線分の比","中点連結定理、角の二等分線と比","面積の比、体積の比","円周角の定理(1)","円周角の定理(2)","三平方の定理","平面図形への利用(1)","平面図形への利用(2)","空間図形への利用","標本調査"],
            },
            {   
                id:"new-m-basic-1",
                title:"新中学問題集　標準編　1年",
                level:"基礎",
                contents:["素因数分解","正負の数","加法と減法","乗法と除法","正負の数の利用","文字式の表し方","数量の表し方・式の値","一次式の計算","文字式の利用","方程式とその解き方","方程式の解き方(1)","方程式の解き方(2)","比例と反比例","座標とグラフ","座標・グラフと図形","直角と角","図形の移動","作図","おうぎ形","空間図形","立体の体積と表面積","立体の応用的なとらえ方","データの活用","統計的確率"],
            },
            {   
                id:"new-m-basic-2",
                title:"新中学問題集　標準編　2年",
                level:"基礎",
                contents:["式と計算","式の利用","連立方程式の解き方","連立方程式の利用(1)","連立方程式の利用(2)","1次関数","1次関数の求め方","1次関数と方程式","グラフと図形","1次関数の利用","平行線と角、三角形と角","多角形と角","合同な図形","証明のすすめ方","二等辺三角形","直角三角形","平行四辺形","特別な平行四辺形・平行線と面積","場合の数","確率","四分位範囲と箱ひげ図"],
            },
            {   
                id:"new-m-basic-3",
                title:"新中学問題集　標準編　3年",
                level:"基礎",
                contents:["多項式の計算","因数分解","式の計算の利用","平方根","根号をふくむ式の乗除","根号をふくむ式の計算","2次方程式の解き方","2次方程式の利用","関数 y=ax&sup2;","関数y=ax&sup2;の性質","関数のグラフの利用","相似な図形","平行線と線分の比","面積比・体積比","円と直線","円周角の定理","円の性質の利用","三平方の定理","三平方の定理と平面図形","三平方の定理と空間図形","三平方の定理の応用問題","標本調査"],
            },
        ],
    },
    {
        id:"ms-Sci",
        textbooks:[
            {   
                id:"mc-sci",
                title:"マイクリア　全学年",
                level:"基礎",
                contents:["植物の特徴と分類","動物の特徴と分類","生物と細胞、植物のからだとつくりとはたらき","消化と吸収、呼吸、血液の成分とはたらき","血液の循環と排出、刺激と反応","物質の性質、気体の性質","水溶液の性質、状態変化","物質の成り立ちと化学変化","酸化と還元、化学変化と熱","化学変化と物質の質量","光","音と力","電気と回路、電気とそのエネルギー","電流の正体、電流と磁界","火山と地震","地層と大地の変動","気象観測、空気中の水の変化","前線の通過と天気の変化","大気の動きと日本の天気","無性生殖と有性生殖","遺伝の規則性","生物の種類の多様性と進化","原子の成り立ち、酸・アルカリとイオン","中和とイオン","電池とイオン","力の合成と分解、水中の物体にはたらく力","運動の測定と力がはたらく運動","力がはたらかない運動と運動の法則","仕事と力学的エネルギー","いろいろなエネルギーとその移り変わり","転貸の一日の動きと地球の自転","地球の公転と天体の動きや季節の変化","月と惑星の動きと見え方","太陽系と宇宙の広がり","自然界の生物のはたらきとつり合い","エネルギー資源の利用、自然環境と科学技術","重要基礎知識","実験・観察の重要事項","記述の問題","作図の問題","公式・法則の利用","表・グラフの利用","思考力を育てる問題"],
            },
            {   
                id:"new-j-basic-2",
                title:"新中学問題集　国語　標準編",
                level:"基礎",
                contents:["","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            },
        ],
    },
    {
        id:"ms-Soc",
        textbooks:[
                {   
                    id:"mc-soc",
                    title:"マイクリア　全学年",
                    level:"基礎",
                    contents:["世界の地域構成、日本の地域構成","世界の人々の生活と環境","アジア、アフリカ","ヨーロッパ、南北アメリカ、オセアニア","世界から見た日本","九州地方、中国・四国地方","近畿地方、中部地方","関東地方、東北地方、北海道地方、地形図","平安時代までの日本","鎌倉から安土桃山時代までの日本","19世紀までの世界","近代日本の出発","日清・日露戦争と大正時代","第二次世界大戦から現代まで","現代の日本社会","人権思想の発達と日本国憲法","基本的人権の尊重","選挙の仕組みと国会","内閣と裁判所","地方自治","消費生活と生産","労働と経済","財政と副詞","環境保全と国際社会","計算マスター","地形図マスター","作図マスター","世界の産業","世界の貿易","日本の産業","日本の貿易","地理の記述問題","日本の外交史","日本の農村史","日本の文化・宗教史","歴史の資料問題","歴史の記述問題","公民の資料読み取り問題","公民の記述の問題"],
                },
                {   
                    id:"new-j-basic-2",
                    title:"新中学問題集　国語　標準編",
                    level:"基礎",
                    contents:["","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
                },
        ],
    },
]
const $ps_subjects_data = [
    {
        id:"ps-Eng",
        textbooks:[

        ],
    },
    {
        id:"ps-Japanese",
        textbooks:[
            {   
                id:"ss-st1",
                title:"新小学問題集 中学入試編　ステージⅠ",
                level:"基礎",
                contents:["語句や文の意味を捕らえる","あらすじ・場面をとらえる","心情をとらえる","表現の工夫をつかむ","こそあどことばとつなぎことば","前後関係から文脈をとらえる","段落の要点と段落どうしのつながりを考える","主題・趣旨をとらえる","物語文(1)","物語文(2)","説明文(1)","説明文(2)","物語文(3)","物語文(4)","説明文(3)","説明文(4)","物語文(5)","説明文(5)","物語文(6)","説明文(6)","物語文(7)","説明文(7)","説明文(8)","詩","随筆文(1)","随筆文(2)","意見文(1)","意見文(2)"],
            },
            {   
                id:"ss-st2",
                title:"新小学問題集 中学入試編　ステージⅡ",
                level:"基礎",
                contents:["指示語・接続語で文脈をとらえる","要点をとらえ、段落の働き・要点を理解する","表現内容を明らかにし、場面・情景をつかむ","心情・性格をつかむ","主題・要旨をつかむ","文学的文章(1)","文学的文章(2)","説明的文章(1)","説明的文章(2)","詩","文学的文章(3)","文学的文章(4)","説明的文章(3)","説明的文章(4)","文学的文章(5)","文学的文章(6)","説明的文章(5)","説明的文章(6)","文学的文章(7)","文学的文章(8)","説明的文章(7)","説明的文章(8)","短歌・俳句","文学的文章(9)","文学的文章(10)","説明的文章(9)","説明的文章(10)"],
            },
            {   
                id:"ss-st3",
                title:"新小学問題集 中学入試編　ステージⅢ",
                level:"基礎",
                contents:["文脈をとらえる","表現を吟味し、心情・情景をつかむ","主題・要旨をおさえる","文学的文章(1)","文学的文章(2)","説明的文章(1)","説明的文章(2)","文学的文章(3)","文学的文章(4)","説明的文章(3)","説明的文章(4)","文学的文章(5)","文学的文章(6)","説明的文章(5)","説明的文章(6)","文学的文章(7)","文学的文章(8)","説明的文章(7)","説明的文章(8)","詩歌(1)","文学的文章(9)","文学的文章(10)","説明的文章(9)","説明的文章(10)","文学的文章(11)","文学的文章(12)","説明的文章(11)","説明的文章(12)","詩歌(2)","実践問題(1)","実践問題(2)"],
            },
        ],
    },
    {
        id:"ps-Math",
        textbooks:[

        ],
    },
    {
        id:"ps-Sci",
        textbooks:[

        ],
    },
    {
        id:"ps-Soc",
        textbooks:[

        ],
    },
]